Revit 2027 API
NumberedReferenceInfo.NumberingParameterId Property
 The parameter id associated with this reference that is used for numbering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId NumberingParameterId { get; }
Public ReadOnly Property NumberingParameterId As ElementId
	Get
public:
property ElementId^ NumberingParameterId {
	ElementId^ get ();
}
member NumberingParameterId : ElementId with get
Property Value
ElementId
See Also
Reference
NumberedReferenceInfo Class
Autodesk.Revit.DB Namespace